# 프로그램의 3대 논리 - 순차, 조건 , 반복
# 순차- 명령어를 위에서 아래로 순서대로 실행
# 선택- 조건에 따라 실행할 명령어가 달라짐
# 반복- 같은 명령어를 반복 수행


# 조건문
# 어떤 조건에 따라 프로그램 실행 흐름을 제어하는 문장
# 명령의 분기를 만드는 도구
# 파이썬에서는 if문을 이용해 조건문을 작성


# 단순 if 문
# i 조건식:
#   참일때실행할명령

# 블록 block
# 여러 개의 명령문을 하나의 논리적 단위로 묶은 것
# 조건문/반복문에서 조건이 참일때 실행할 코드들을 묶은 부분
# 즉, 여러 줄의 코드를 하나의 실행 단위로 만든 것
# 파이썬에서는 블록을 들여쓰기(indent)으로 구분함

# ex) 시험 점수가 85점 이상이면 '합격'이라 출력
jumsu= 90
result = '불합격입니다!!' # 결과에 대한 초기값 설정

if jumsu >= 85:
    result = '합격입니다!!'

    print(result)

# ex) 4-5
rate = float(input('Enter your score :'))
result = '해외 연수 기회느 다음에 ...'

if rate >= 4.2:
    result = '해외 연수 기회 부여!'

print(f'당신의 평점:{rate}')
print(result)

#기본 if
# if 조건식:
#    참일떄실행할 명령
# else
#     거짓일떄실행할명령

#ex) 65세 기준으로 '경로우대 승차권 발급' 여부
age = int(input('나이를 입력하세요:'))

if age >=65:
    result='지하철 경로우대 승차권 발급'
else:
    result='자동 발매기를 이용해주셔서 감사합니다'

print(result)
print('자동 발매기를 이용해주셔서 감사합니다.')


# ex) 두 개의 수를 입력받아 큰수를 출력

# 두 수 입력받기
num1 = int(input('첫 번쨰 수를 입력하세요:'))
num2 = int(input('두 번쨰 수를 입력하세요:'))

# 큰 수 출력
if num1 > num2:
    result='f 큰 수는:,{num1} 작은 수는{num2} 입니다'

else:
    result='f 큰 수는:,{num1} 작은 수는{num2} 입니다'





# 단 , 같은 수 2개를 입력했을 떄 처리하는 코드 추가

num1 = int(input('첫 번쨰 수를 입력하세요:'))
num2 = int(input('두 번쨰 수를 입력하세요:'))

# 큰 수 출력
if num1 > num2:
    result='f 큰 수는:,{num1} 작은 수는{num2} 입니다'
elif num2 > num1:
    result= 'f 큰 수는:,{num2} 작은 수는{num1} 입니다'
else:
    result='f 큰 수는:,{num1} 작은 수는{num2} 입니다'

    result = '입력한 두 수는 크기가 같습니다'








# 문자열 비교
# ==, != :문자열 내용과 생성된 메모리 위치 비교
#>,<, >=, <=: 문자열을 사전순(유니코드 순서)으로 비교
print('a' > 'A')  # a:97 ,A:65
print('*' < 'k')  # *:42, k:107
print('김' < '강') # 김:44608, 강:44053
print ('cskim' <'CSKIM') # c:99,C:67
print('John'< 'Joho')    # n:110 ,0:111
print('홍길동'<'홍길딩')    # 덩:46020, 딩 :46308


# 성별, 키, 몸무게 입력받기
gender = input("성별을 입력하세요 (남자/여자):  ")
height = int(input("키를 입력하세요 (cm):165 "))
weight = int(input("몸무게를 입력하세요 (kg ):59 "))





# match / case 문
# python 3.10 부터 새롭게 추가된 조건 판별 구문
# if문은 조건식 결과가 참/거짓 여부에 따라 분기했었음
# 반면에, match/case문은 값이나 패턴에 따라 분기함
# match 변수:
# case 값1:
#    실행문1
# case 값2:
#    실행문2
# case_:
#     실행문3
S