# 예외 exception
# 프로그램이 실행되는 도중에 예산치 못한 문제가 발생해
# 정상적인 흐름이 꺠지는 상황
# 즉 , 프로그램이 하려던 일을 갑자기 제대로 할수 없을때 발생하는 사건

print('프로그램 시작1!')
print(int(input('숫자를 하나 입력하세요(1)')))
print('프로그램 끝1!')

print('프로그램 시작2!')
print(int(input('숫자를 하나 입력하세요(2)')))
print('프로그램 끝2!')

# 예외처리
# 프로그램에서 오류가 발생하더라고 비정상적인 종료없이
# 안정하게 흐름을 유지하고, 문제를 올바르게 처리하도록 하는 것
# 프로그램의 비정상 오류방지
# 오류 상황에 대한 적절한 대응 제공
# 오류 원인 파악 및 로깅 용이 - 문제해결, 디버깅 수월
# 파이썬에서는 try -except 예외처리 구현

print('프로그램 시작4!')
try:
    # 숫자 대신 문자를 입력하면?
    num =int(input('숫자를 하나 입력하세요(4)'))
    print(f'입력한 숫자:{num}')
except:
    print('숫자만 입력하셔야합니다!!')
print('프로그램 끝4!')


print('프로그램 시작5!')
with open('abc123.xyz','r') as f:
    data = f.read()
    print(data)
print('프로그램 끝 5!')





